app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Song 2"], ["artist_id", 1], ["created_at", "2016-01-27 00:20:14.516774"], ["updated_at", "2016-01-27 00:20:14.516774"]]
---
  def create
    # binding.pry
    @song = Song.new(song_params)

    if @song.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 18]]
---
  def edit
    # binding.pry
    if params[:artist_id]
      artist = Artist.find_by(id:params[:artist_id])
      if artist.nil?
        redirect_to artists_path, alert: 'Artist not found'
      else
        @song = artist.songs.find_by(id:params[:id])